[
    {
        "title":"Software Architecture",
        "description":"If you want to build something new, you got to know how to do it, which technologies to use, which architecture, scope, infrastructure you are going to need. Building a simple mobile app does seem like a very easy task, but if you go deeper in the requisites you will find that you need a whole backend to sustain that app, and, even, the app is not the right choice to that MVP. You need someone with experience to tell you what is the better choice to make and why."
    },
    {
        "title":"Information Architecture",
        "description":"You got your requisites, your functionalities and a clear idea of what you want to build. But, is your information correctly architectured? do you know how much information you'll need? and how to store it? which paradigm to use? which tecnology? It's very difficult to transform functionalities and requisites into a well information structure, but I know how to do it in many ways and in different paradigms. Thats one of the very first things you do when building a solution: information architecturing."
    },
    {
        "title":"Software Fullstack Development",
        "description":"I can build APIs, Web applications, mobile apps, small desktop tools, integrations... I have 5 years of experience building APIs in .Net, .Net Core, NodeJs+Express... Webapps in Angular, PHP, plain JS+HTML5... websites in Wordpress, PHP, GatsbyJS... and I know which tool to use in each case. There aren't silver bullets and neither do I have. That's why since I started my career I wanted to explore as many possibilities as I could, so I could choose the better solution for each problem. And when I am not sure, I continue exploring."
    },
    {
        "title":"Office 365 & Active Directory Operations",
        "description":"I have used Exchange, Sharepoint and Active Directory for the past 2 years and I've been in charge of different tasks such as migrations from on-premises infrastructure to Active Directory + Office 365, Exchange mail flow rules, permissions and security, Sharepoint multi-site-collections administration, licenses administration, active directory groups administration, migration of hundreds of GBs of video and image data from an on premise infrastructure to Sharepoint... these weren't easy tasks that anyone can perform and required a lot of research and knowledge and testing."
    }
]